---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.NamingUtils
source: html/e9a552da-0418-7db1-bee8-c0a895ab62c2.htm
---
# NamingUtils Members

Compares two object name strings using Revit's comparison rules.